[{"id":1,"text":"На входе 5 значений. Все эти значения пользователь вводит с клавиатуры и заполяет массив. Далее необходимо создать массив только из чисел. Если длинa массива равна 0, то вывести ‘Массив пуст’. filter","time":5,"complexity":1,"scores":2},{"id":2,"text":"На входе 7 чисел. Все эти значения пользователь вводит с клавиатуры и заполяет 5 первыми значениями массив. Далее необходимо создать массив из тех значений, которые являются числами и НЕ равны 2 другим введенным. Если длина массива равна 0, то вывести ‘Массив пуст’. Добавить проверку на ввод только чисел после каждого введенного элемента. forEach","time":10,"complexity":2,"scores":4},{"id":3,"text":"На входе n – количество элементов массива. Далее производится заполнение массива с клавиатуры. Необходимо вывести значения массива без дублирования. Если длина массива равна 0, то вывести ‘Массив пуст’. Добавить проверку на ввод только чисел после каждого введенного элемента. ","time":15,"complexity":3,"scores":6},{"id":4,"text":"Заполнять массив числами бесконечно до тех пор, пока длина массива не будет равна 5. Вывести массив в консоль (цикл for, while)","time":20,"complexity":4,"scores":8},{"id":5,"text":"На входе 10 элементов. Из элементов составить 2 массива по 5 элементов. Далее необходимо сравнить массивы. Если они идентичны, то вывести булевое true, в противном случае false","time":25,"complexity":5,"scores":10},{"id":6,"text":"На входе n – количество элементов массива. Далее производится заполнение массива с клавиатуры. Необходимо вывести true, если хотя бы 1 элемент массива – число. Some","time":30,"complexity":6,"scores":12},{"id":7,"text":"На входе n – количество элементов массива. Далее производится заполнение массива с клавиатуры. Если все элементы массива – числа, то вывести логическое true, в противном случае false. Every, forEach","time":35,"complexity":7,"scores":14},{"id":"8","text":"На входе n – количество элементов массива. Далее производится заполнение массива с клавиатуры. Если все элементы массива – числа, то вывести логическое true, в противном случае false. Every, forEach","time":55,"complexity":14,"scores":20},{"id":9,"text":35,"time":7,"complexity":14},{"id":10,"text":"На входе n – количество элементов массива. Далее производится заполнение массива с клавиатуры. Если все элементы массива – числа, то вывести логическое true, в противном случае false. Every, forEach","time":35,"complexity":7,"scores":14},{"id":11,"text":35,"time":7,"complexity":14},{"id":12,"text":"На входе n – количество элементов массива. Далее производится заполнение массива с клавиатуры. Если все элементы массива – числа, то вывести логическое true, в противном случае false. Every, forEach","time":35,"complexity":7,"scores":14}]